Catalogs/UDS_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>UDS_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьСписаниеБонусовПоНомеруТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНачисленияБонусов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНачисленияБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИдентификаторыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/UDS_ОбщийМодульВызовСервера/Ext/Module.bsl
//#13359

#Область ПрограммныйИнтерфейс

Функция ИспользуетсяUDS() Экспорт
	
	Возврат Константы.UDS_ИспользоватьИнтеграцию.Получить();

КонецФункции

//Функция ПолучитьПараметрыАвторизации(Организация) Экспорт	
Функция ПолучитьНастройки(Организация) Экспорт	

	СтруктураВозврата = Новый Структура("IDКомпании, APIKey, РазрешитьСписаниеБонусовПоНомеруТелефона", "", "");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	UDS_Настройки.IDКомпании КАК IDКомпании,
	|	UDS_Настройки.APIKey КАК APIKey,
	|	UDS_Настройки.РазрешитьСписаниеБонусовПоНомеруТелефона
	|ИЗ
	|	Справочник.UDS_Настройки КАК UDS_Настройки
	|ГДЕ
	|	НЕ UDS_Настройки.ПометкаУдаления
	|	И UDS_Настройки.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьРежимНачисленияБонусов(Организация) Экспорт	

	СтруктураВозврата = Новый Структура("РежимНачисленияБонусов", Перечисления.РежимыНачисленияБонусов.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	UDS_Настройки.РежимНачисленияБонусов КАК РежимНачисленияБонусов
	|ИЗ
	|	Справочник.UDS_Настройки КАК UDS_Настройки
	|ГДЕ
	|	НЕ UDS_Настройки.ПометкаУдаления
	|	И UDS_Настройки.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьДанныеПоТранзакциям(СтруктураДокументов) Экспорт
	
	ТаблицаДокументов = ОбщийМодульСервер.ПреобразоватьМассивВТаблицуЗначений(СтруктураДокументов, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокументов.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаДокументов.СуммаВозврата КАК СуммаВозврата
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ДокументПродажи КАК ДокументПродажи,
	|	СУММА(ВТ.СуммаВозврата) КАК СуммаВозврата,
	|	ВЫРАЗИТЬ(ДокументРеализацияТоваровИУслуг.UDS_ИдентификаторОперации КАК СТРОКА(50)) КАК ИдентификаторОперации
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровИУслуг КАК ДокументРеализацияТоваровИУслуг
	|		ПО (ДокументРеализацияТоваровИУслуг.Ссылка = ВТ.ДокументПродажи)
	|			И (НЕ (ВЫРАЗИТЬ(ДокументРеализацияТоваровИУслуг.UDS_ИдентификаторОперации КАК СТРОКА(50))) = """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ДокументПродажи,
	|	ВЫРАЗИТЬ(ДокументРеализацияТоваровИУслуг.UDS_ИдентификаторОперации КАК СТРОКА(50))";
	
	ТаблицаИД = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаИД);
		
КонецФункции

#КонецОбласти
